backbone:
  [[-1, 1, Conv, [16, 3, 2, None, 1, nn.ReLU()]],
   
   [-1, 1, ETSFABN, [16, 1, 1]],
   [-1, 1, ETSFABN, [24, 2, 6]],
   [-1, 1, ETSFABN, [24, 1, 6]],
   [-1, 1, ETSFABN, [32, 2, 6]],
   [-1, 1, ETSFABN, [32, 1, 6]],
   [-1, 1, ETSFABN, [32, 1, 6]],                        # 6 - P3
   [-1, 1, ETSFABN, [64, 2, 6]],
   [-1, 1, ETSFABN, [64, 1, 6]],
   [-1, 1, ETSFABN, [64, 1, 6]],
   [-1, 1, ETSFABN, [64, 1, 6]],
   [-1, 1, ETSFABN, [96, 1, 6]],
   [-1, 1, ETSFABN, [96, 1, 6]],
   [-1, 1, ETSFABN, [96, 1, 6]],                        # 13 - P4
   [-1, 1, ETSFABN, [160, 2, 6]],
   [-1, 1, ETSFABN, [160, 1, 6]],
   [-1, 1, ETSFABN, [160, 1, 6]],
   [-1, 1, ETSFABN, [320, 1, 6]],                       # 17 - P5
  ]

neck:
  [[-1, 1, EDFA, [96, 20]],
   [-1, 1, Conv, [96, 1, 1, None, 1, nn.ReLU()]],
   [-1, 1, nn.Upsample, [None, 2, "nearest"]],
   [[-1, 13], 1, Concat, [1]], # cat backbone P4
   [-1, 1, C3, [96]], # 22

   [-1, 1, Conv, [32, 1, 1, None, 1, nn.ReLU()]],
   [-1, 1, nn.Upsample, [None, 2, "nearest"]],
   [[-1, 6], 1, Concat, [1]], # cat backbone P3
   [-1, 1, C3, [32]], # 26 (P3/8-small)

   [-1, 1, Conv, [32, 3, 2, None, 1, nn.ReLU()]],
   [[-1, 23], 1, Concat, [1]], # cat head P4
   [-1, 1, C3, [64]], # 29 (P4/16-medium)

   [-1, 1, Conv, [96, 3, 2, None, 1, nn.ReLU()]],
   [[-1, 18], 1, Concat, [1]], # cat head P5
   [-1, 1, C3, [192]], # 32 (P5/32-large)
  ]

head:
  [[[26, 29, 32], 1, LSAHEAD, [nc, anchors, size]],   # Detect(P3, P4, P5)
  ]
